GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0E2Dh
// bitfield definitions
PIE4_TX3IE_POSN                          equ 0000h
PIE4_TX3IE_POSITION                      equ 0000h
PIE4_TX3IE_SIZE                          equ 0001h
PIE4_TX3IE_LENGTH                        equ 0001h
PIE4_TX3IE_MASK                          equ 0001h
PIE4_RC3IE_POSN                          equ 0001h
PIE4_RC3IE_POSITION                      equ 0001h
PIE4_RC3IE_SIZE                          equ 0001h
PIE4_RC3IE_LENGTH                        equ 0001h
PIE4_RC3IE_MASK                          equ 0002h
PIE4_TX4IE_POSN                          equ 0002h
PIE4_TX4IE_POSITION                      equ 0002h
PIE4_TX4IE_SIZE                          equ 0001h
PIE4_TX4IE_LENGTH                        equ 0001h
PIE4_TX4IE_MASK                          equ 0004h
PIE4_RC4IE_POSN                          equ 0003h
PIE4_RC4IE_POSITION                      equ 0003h
PIE4_RC4IE_SIZE                          equ 0001h
PIE4_RC4IE_LENGTH                        equ 0001h
PIE4_RC4IE_MASK                          equ 0008h
PIE4_TX5IE_POSN                          equ 0004h
PIE4_TX5IE_POSITION                      equ 0004h
PIE4_TX5IE_SIZE                          equ 0001h
PIE4_TX5IE_LENGTH                        equ 0001h
PIE4_TX5IE_MASK                          equ 0010h
PIE4_RC5IE_POSN                          equ 0005h
PIE4_RC5IE_POSITION                      equ 0005h
PIE4_RC5IE_SIZE                          equ 0001h
PIE4_RC5IE_LENGTH                        equ 0001h
PIE4_RC5IE_MASK                          equ 0020h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0E2Eh
// bitfield definitions
PIE5_TMR1IE_POSN                         equ 0000h
PIE5_TMR1IE_POSITION                     equ 0000h
PIE5_TMR1IE_SIZE                         equ 0001h
PIE5_TMR1IE_LENGTH                       equ 0001h
PIE5_TMR1IE_MASK                         equ 0001h
PIE5_TMR2IE_POSN                         equ 0001h
PIE5_TMR2IE_POSITION                     equ 0001h
PIE5_TMR2IE_SIZE                         equ 0001h
PIE5_TMR2IE_LENGTH                       equ 0001h
PIE5_TMR2IE_MASK                         equ 0002h
PIE5_TMR3IE_POSN                         equ 0002h
PIE5_TMR3IE_POSITION                     equ 0002h
PIE5_TMR3IE_SIZE                         equ 0001h
PIE5_TMR3IE_LENGTH                       equ 0001h
PIE5_TMR3IE_MASK                         equ 0004h
PIE5_TMR4IE_POSN                         equ 0003h
PIE5_TMR4IE_POSITION                     equ 0003h
PIE5_TMR4IE_SIZE                         equ 0001h
PIE5_TMR4IE_LENGTH                       equ 0001h
PIE5_TMR4IE_MASK                         equ 0008h
PIE5_TMR5IE_POSN                         equ 0004h
PIE5_TMR5IE_POSITION                     equ 0004h
PIE5_TMR5IE_SIZE                         equ 0001h
PIE5_TMR5IE_LENGTH                       equ 0001h
PIE5_TMR5IE_MASK                         equ 0010h
PIE5_TMR6IE_POSN                         equ 0005h
PIE5_TMR6IE_POSITION                     equ 0005h
PIE5_TMR6IE_SIZE                         equ 0001h
PIE5_TMR6IE_LENGTH                       equ 0001h
PIE5_TMR6IE_MASK                         equ 0020h
PIE5_TMR7IE_POSN                         equ 0006h
PIE5_TMR7IE_POSITION                     equ 0006h
PIE5_TMR7IE_SIZE                         equ 0001h
PIE5_TMR7IE_LENGTH                       equ 0001h
PIE5_TMR7IE_MASK                         equ 0040h
PIE5_TMR8IE_POSN                         equ 0007h
PIE5_TMR8IE_POSITION                     equ 0007h
PIE5_TMR8IE_SIZE                         equ 0001h
PIE5_TMR8IE_LENGTH                       equ 0001h
PIE5_TMR8IE_MASK                         equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 0E2Fh
// bitfield definitions
PIE6_TMR1GIE_POSN                        equ 0000h
PIE6_TMR1GIE_POSITION                    equ 0000h
PIE6_TMR1GIE_SIZE                        equ 0001h
PIE6_TMR1GIE_LENGTH                      equ 0001h
PIE6_TMR1GIE_MASK                        equ 0001h
PIE6_TMR3GIE_POSN                        equ 0001h
PIE6_TMR3GIE_POSITION                    equ 0001h
PIE6_TMR3GIE_SIZE                        equ 0001h
PIE6_TMR3GIE_LENGTH                      equ 0001h
PIE6_TMR3GIE_MASK                        equ 0002h
PIE6_TMR5GIE_POSN                        equ 0002h
PIE6_TMR5GIE_POSITION                    equ 0002h
PIE6_TMR5GIE_SIZE                        equ 0001h
PIE6_TMR5GIE_LENGTH                      equ 0001h
PIE6_TMR5GIE_MASK                        equ 0004h
PIE6_TMR7GIE_POSN                        equ 0003h
PIE6_TMR7GIE_POSITION                    equ 0003h
PIE6_TMR7GIE_SIZE                        equ 0001h
PIE6_TMR7GIE_LENGTH                      equ 0001h
PIE6_TMR7GIE_MASK                        equ 0008h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 0E30h
// bitfield definitions
PIE7_CCP1IE_POSN                         equ 0000h
PIE7_CCP1IE_POSITION                     equ 0000h
PIE7_CCP1IE_SIZE                         equ 0001h
PIE7_CCP1IE_LENGTH                       equ 0001h
PIE7_CCP1IE_MASK                         equ 0001h
PIE7_CCP2IE_POSN                         equ 0001h
PIE7_CCP2IE_POSITION                     equ 0001h
PIE7_CCP2IE_SIZE                         equ 0001h
PIE7_CCP2IE_LENGTH                       equ 0001h
PIE7_CCP2IE_MASK                         equ 0002h
PIE7_CCP3IE_POSN                         equ 0002h
PIE7_CCP3IE_POSITION                     equ 0002h
PIE7_CCP3IE_SIZE                         equ 0001h
PIE7_CCP3IE_LENGTH                       equ 0001h
PIE7_CCP3IE_MASK                         equ 0004h
PIE7_CCP4IE_POSN                         equ 0003h
PIE7_CCP4IE_POSITION                     equ 0003h
PIE7_CCP4IE_SIZE                         equ 0001h
PIE7_CCP4IE_LENGTH                       equ 0001h
PIE7_CCP4IE_MASK                         equ 0008h
PIE7_CCP5IE_POSN                         equ 0004h
PIE7_CCP5IE_POSITION                     equ 0004h
PIE7_CCP5IE_SIZE                         equ 0001h
PIE7_CCP5IE_LENGTH                       equ 0001h
PIE7_CCP5IE_MASK                         equ 0010h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 0E31h
// bitfield definitions
PIE8_CWG1IE_POSN                         equ 0000h
PIE8_CWG1IE_POSITION                     equ 0000h
PIE8_CWG1IE_SIZE                         equ 0001h
PIE8_CWG1IE_LENGTH                       equ 0001h
PIE8_CWG1IE_MASK                         equ 0001h
PIE8_NVMIE_POSN                          equ 0005h
PIE8_NVMIE_POSITION                      equ 0005h
PIE8_NVMIE_SIZE                          equ 0001h
PIE8_NVMIE_LENGTH                        equ 0001h
PIE8_NVMIE_MASK                          equ 0020h
PIE8_CRCIE_POSN                          equ 0006h
PIE8_CRCIE_POSITION                      equ 0006h
PIE8_CRCIE_SIZE                          equ 0001h
PIE8_CRCIE_LENGTH                        equ 0001h
PIE8_CRCIE_MASK                          equ 0040h
PIE8_SCANIE_POSN                         equ 0007h
PIE8_SCANIE_POSITION                     equ 0007h
PIE8_SCANIE_SIZE                         equ 0001h
PIE8_SCANIE_LENGTH                       equ 0001h
PIE8_SCANIE_MASK                         equ 0080h

// Register: PIE9
#define PIE9 PIE9
PIE9                                     equ 0E32h
// bitfield definitions
PIE9_SMT1IE_POSN                         equ 0000h
PIE9_SMT1IE_POSITION                     equ 0000h
PIE9_SMT1IE_SIZE                         equ 0001h
PIE9_SMT1IE_LENGTH                       equ 0001h
PIE9_SMT1IE_MASK                         equ 0001h
PIE9_SMT1PRAIE_POSN                      equ 0001h
PIE9_SMT1PRAIE_POSITION                  equ 0001h
PIE9_SMT1PRAIE_SIZE                      equ 0001h
PIE9_SMT1PRAIE_LENGTH                    equ 0001h
PIE9_SMT1PRAIE_MASK                      equ 0002h
PIE9_SMT1PWAIE_POSN                      equ 0002h
PIE9_SMT1PWAIE_POSITION                  equ 0002h
PIE9_SMT1PWAIE_SIZE                      equ 0001h
PIE9_SMT1PWAIE_LENGTH                    equ 0001h
PIE9_SMT1PWAIE_MASK                      equ 0004h
PIE9_SMT2IE_POSN                         equ 0003h
PIE9_SMT2IE_POSITION                     equ 0003h
PIE9_SMT2IE_SIZE                         equ 0001h
PIE9_SMT2IE_LENGTH                       equ 0001h
PIE9_SMT2IE_MASK                         equ 0008h
PIE9_SMT2PRAIE_POSN                      equ 0004h
PIE9_SMT2PRAIE_POSITION                  equ 0004h
PIE9_SMT2PRAIE_SIZE                      equ 0001h
PIE9_SMT2PRAIE_LENGTH                    equ 0001h
PIE9_SMT2PRAIE_MASK                      equ 0010h
PIE9_SMT2PWAIE_POSN                      equ 0005h
PIE9_SMT2PWAIE_POSITION                  equ 0005h
PIE9_SMT2PWAIE_SIZE                      equ 0001h
PIE9_SMT2PWAIE_LENGTH                    equ 0001h
PIE9_SMT2PWAIE_MASK                      equ 0020h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 0E33h
// bitfield definitions
PIR0_INT0IF_POSN                         equ 0000h
PIR0_INT0IF_POSITION                     equ 0000h
PIR0_INT0IF_SIZE                         equ 0001h
PIR0_INT0IF_LENGTH                       equ 0001h
PIR0_INT0IF_MASK                         equ 0001h
PIR0_INT1IF_POSN                         equ 0001h
PIR0_INT1IF_POSITION                     equ 0001h
PIR0_INT1IF_SIZE                         equ 0001h
PIR0_INT1IF_LENGTH                       equ 0001h
PIR0_INT1IF_MASK                         equ 0002h
PIR0_INT2IF_POSN                         equ 0002h
PIR0_INT2IF_POSITION                     equ 0002h
PIR0_INT2IF_SIZE                         equ 0001h
PIR0_INT2IF_LENGTH                       equ 0001h
PIR0_INT2IF_MASK                         equ 0004h
PIR0_INT3IF_POSN                         equ 0003h
PIR0_INT3IF_POSITION                     equ 0003h
PIR0_INT3IF_SIZE                         equ 0001h
PIR0_INT3IF_LENGTH                       equ 0001h
PIR0_INT3IF_MASK                         equ 0008h
PIR0_IOCIF_POSN                          equ 0004h
PIR0_IOCIF_POSITION                      equ 0004h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0010h
PIR0_TMR0IF_POSN                         equ 0005h
PIR0_TMR0IF_POSITION                     equ 0005h
PIR0_TMR0IF_SIZE                         equ 0001h
PIR0_TMR0IF_LENGTH                       equ 0001h
PIR0_TMR0IF_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0E34h
// bitfield definitions
PIR1_ADIF_POSN                           equ 0000h
PIR1_ADIF_POSITION                       equ 0000h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0001h
PIR1_ADTIF_POSN                          equ 0001h
PIR1_ADTIF_POSITION                      equ 0001h
PIR1_ADTIF_SIZE                          equ 0001h
PIR1_ADTIF_LENGTH                        equ 0001h
PIR1_ADTIF_MASK                          equ 0002h
PIR1_CSWIF_POSN                          equ 0006h
PIR1_CSWIF_POSITION                      equ 0006h
PIR1_CSWIF_SIZE                          equ 0001h
PIR1_CSWIF_LENGTH                        equ 0001h
PIR1_CSWIF_MASK                          equ 0040h
PIR1_OSCFIF_POSN                         equ 0007h
PIR1_OSCFIF_POSITION                     equ 0007h
PIR1_OSCFIF_SIZE                         equ 0001h
PIR1_OSCFIF_LENGTH                       equ 0001h
PIR1_OSCFIF_MASK                         equ 0080h
PIR1_PSPIF_POSN                          equ 0007h
PIR1_PSPIF_POSITION                      equ 0007h
PIR1_PSPIF_SIZE                          equ 0001h
PIR1_PSPIF_LENGTH                        equ 0001h
PIR1_PSPIF_MASK                          equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0E35h
// bitfield definitions
PIR2_C1IF_POSN                           equ 0000h
PIR2_C1IF_POSITION                       equ 0000h
PIR2_C1IF_SIZE                           equ 0001h
PIR2_C1IF_LENGTH                         equ 0001h
PIR2_C1IF_MASK                           equ 0001h
PIR2_C2IF_POSN                           equ 0001h
PIR2_C2IF_POSITION                       equ 0001h
PIR2_C2IF_SIZE                           equ 0001h
PIR2_C2IF_LENGTH                         equ 0001h
PIR2_C2IF_MASK                           equ 0002h
PIR2_C3IF_POSN                           equ 0002h
PIR2_C3IF_POSITION                       equ 0002h
PIR2_C3IF_SIZE                           equ 0001h
PIR2_C3IF_LENGTH                         equ 0001h
PIR2_C3IF_MASK                           equ 0004h
PIR2_ZCDIF_POSN                          equ 0006h
PIR2_ZCDIF_POSITION                      equ 0006h
PIR2_ZCDIF_SIZE                          equ 0001h
PIR2_ZCDIF_LENGTH                        equ 0001h
PIR2_ZCDIF_MASK                          equ 0040h
PIR2_HLVDIF_POSN                         equ 0007h
PIR2_HLVDIF_POSITION                     equ 0007h
PIR2_HLVDIF_SIZE                         equ 0001h
PIR2_HLVDIF_LENGTH                       equ 0001h
PIR2_HLVDIF_MASK                         equ 0080h
PIR2_CMIF_POSN                           equ 0006h
PIR2_CMIF_POSITION                       equ 0006h
PIR2_CMIF_SIZE                           equ 0001h
PIR2_CMIF_LENGTH                         equ 0001h
PIR2_CMIF_MASK                           equ 0040h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0E36h
// bitfield definitions
PIR3_SSP1IF_POSN                         equ 0000h
PIR3_SSP1IF_POSITION                     equ 0000h
PIR3_SSP1IF_SIZE                         equ 0001h
PIR3_SSP1IF_LENGTH                       equ 0001h
PIR3_SSP1IF_MASK                         equ 0001h
PIR3_BCL1IF_POSN                         equ 0001h
PIR3_BCL1IF_POSITION                     equ 0001h
PIR3_BCL1IF_SIZE                         equ 0001h
PIR3_BCL1IF_LENGTH                       equ 0001h
PIR3_BCL1IF_MASK                         equ 0002h
PIR3_SSP2IF_POSN                         equ 0002h
PIR3_SSP2IF_POSITION                     equ 0002h
PIR3_SSP2IF_SIZE                         equ 0001h
PIR3_SSP2IF_LENGTH                       equ 0001h
PIR3_SSP2IF_MASK                         equ 0004h
PIR3_BCL2IF_POSN                         equ 0003h
PIR3_BCL2IF_POSITION                     equ 0003h
PIR3_BCL2IF_SIZE                         equ 0001h
PIR3_BCL2IF_LENGTH                       equ 0001h
PIR3_BCL2IF_MASK                         equ 0008h
PIR3_TX1IF_POSN                          equ 0004h
PIR3_TX1IF_POSITION                      equ 0004h
PIR3_TX1IF_SIZE                          equ 0001h
PIR3_TX1IF_LENGTH                        equ 0001h
PIR3_TX1IF_MASK                          equ 0010h
PIR3_RC1IF_POSN                          equ 0005h
PIR3_RC1IF_POSITION                      equ 0005h
PIR3_RC1IF_SIZE                          equ 0001h
PIR3_RC1IF_LENGTH                        equ 0001h
PIR3_RC1IF_MASK                          equ 0020h
PIR3_TX2IF_POSN                          equ 0006h
PIR3_TX2IF_POSITION                      equ 0006h
PIR3_TX2IF_SIZE                          equ 0001h
PIR3_TX2IF_LENGTH                        equ 0001h
PIR3_TX2IF_MASK                          equ 0040h
PIR3_RC2IF_POSN                          equ 0007h
PIR3_RC2IF_POSITION                      equ 0007h
PIR3_RC2IF_SIZE                          equ 0001h
PIR3_RC2IF_LENGTH                        equ 0001h
PIR3_RC2IF_MASK                          equ 0080h
PIR3_RXBNIF_POSN                         equ 0001h
PIR3_RXBNIF_POSITION                     equ 0001h
PIR3_RXBNIF_SIZE                         equ 0001h
PIR3_RXBNIF_LENGTH                       equ 0001h
PIR3_RXBNIF_MASK                         equ 0002h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0E37h
// bitfield definitions
PIR4_TX3IF_POSN                          equ 0000h
PIR4_TX3IF_POSITION                      equ 0000h
PIR4_TX3IF_SIZE                          equ 0001h
PIR4_TX3IF_LENGTH                        equ 0001h
PIR4_TX3IF_MASK                          equ 0001h
PIR4_RC3IF_POSN                          equ 0001h
PIR4_RC3IF_POSITION                      equ 0001h
PIR4_RC3IF_SIZE                          equ 0001h
PIR4_RC3IF_LENGTH                        equ 0001h
PIR4_RC3IF_MASK                          equ 0002h
PIR4_TX4IF_POSN                          equ 0002h
PIR4_TX4IF_POSITION                      equ 0002h
PIR4_TX4IF_SIZE                          equ 0001h
PIR4_TX4IF_LENGTH                        equ 0001h
PIR4_TX4IF_MASK                          equ 0004h
PIR4_RC4IF_POSN                          equ 0003h
PIR4_RC4IF_POSITION                      equ 0003h
PIR4_RC4IF_SIZE                          equ 0001h
PIR4_RC4IF_LENGTH                        equ 0001h
PIR4_RC4IF_MASK                          equ 0008h
PIR4_TX5IF_POSN                          equ 0004h
PIR4_TX5IF_POSITION                      equ 0004h
PIR4_TX5IF_SIZE                          equ 0001h
PIR4_TX5IF_LENGTH                        equ 0001h
PIR4_TX5IF_MASK                          equ 0010h
PIR4_RC5IF_POSN                          equ 0005h
PIR4_RC5IF_POSITION                      equ 0005h
PIR4_RC5IF_SIZE                          equ 0001h
PIR4_RC5IF_LENGTH                        equ 0001h
PIR4_RC5IF_MASK                          equ 0020h

