GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.inc
// Register: ODCOND
#define ODCOND ODCOND
ODCOND                                   equ 0EA5h
// bitfield definitions
ODCOND_ODCD0_POSN                        equ 0000h
ODCOND_ODCD0_POSITION                    equ 0000h
ODCOND_ODCD0_SIZE                        equ 0001h
ODCOND_ODCD0_LENGTH                      equ 0001h
ODCOND_ODCD0_MASK                        equ 0001h
ODCOND_ODCD1_POSN                        equ 0001h
ODCOND_ODCD1_POSITION                    equ 0001h
ODCOND_ODCD1_SIZE                        equ 0001h
ODCOND_ODCD1_LENGTH                      equ 0001h
ODCOND_ODCD1_MASK                        equ 0002h
ODCOND_ODCD2_POSN                        equ 0002h
ODCOND_ODCD2_POSITION                    equ 0002h
ODCOND_ODCD2_SIZE                        equ 0001h
ODCOND_ODCD2_LENGTH                      equ 0001h
ODCOND_ODCD2_MASK                        equ 0004h
ODCOND_ODCD3_POSN                        equ 0003h
ODCOND_ODCD3_POSITION                    equ 0003h
ODCOND_ODCD3_SIZE                        equ 0001h
ODCOND_ODCD3_LENGTH                      equ 0001h
ODCOND_ODCD3_MASK                        equ 0008h
ODCOND_ODCD4_POSN                        equ 0004h
ODCOND_ODCD4_POSITION                    equ 0004h
ODCOND_ODCD4_SIZE                        equ 0001h
ODCOND_ODCD4_LENGTH                      equ 0001h
ODCOND_ODCD4_MASK                        equ 0010h
ODCOND_ODCD5_POSN                        equ 0005h
ODCOND_ODCD5_POSITION                    equ 0005h
ODCOND_ODCD5_SIZE                        equ 0001h
ODCOND_ODCD5_LENGTH                      equ 0001h
ODCOND_ODCD5_MASK                        equ 0020h
ODCOND_ODCD6_POSN                        equ 0006h
ODCOND_ODCD6_POSITION                    equ 0006h
ODCOND_ODCD6_SIZE                        equ 0001h
ODCOND_ODCD6_LENGTH                      equ 0001h
ODCOND_ODCD6_MASK                        equ 0040h
ODCOND_ODCD7_POSN                        equ 0007h
ODCOND_ODCD7_POSITION                    equ 0007h
ODCOND_ODCD7_SIZE                        equ 0001h
ODCOND_ODCD7_LENGTH                      equ 0001h
ODCOND_ODCD7_MASK                        equ 0080h

// Register: WPUD
#define WPUD WPUD
WPUD                                     equ 0EA6h
// bitfield definitions
WPUD_WPUD0_POSN                          equ 0000h
WPUD_WPUD0_POSITION                      equ 0000h
WPUD_WPUD0_SIZE                          equ 0001h
WPUD_WPUD0_LENGTH                        equ 0001h
WPUD_WPUD0_MASK                          equ 0001h
WPUD_WPUD1_POSN                          equ 0001h
WPUD_WPUD1_POSITION                      equ 0001h
WPUD_WPUD1_SIZE                          equ 0001h
WPUD_WPUD1_LENGTH                        equ 0001h
WPUD_WPUD1_MASK                          equ 0002h
WPUD_WPUD2_POSN                          equ 0002h
WPUD_WPUD2_POSITION                      equ 0002h
WPUD_WPUD2_SIZE                          equ 0001h
WPUD_WPUD2_LENGTH                        equ 0001h
WPUD_WPUD2_MASK                          equ 0004h
WPUD_WPUD3_POSN                          equ 0003h
WPUD_WPUD3_POSITION                      equ 0003h
WPUD_WPUD3_SIZE                          equ 0001h
WPUD_WPUD3_LENGTH                        equ 0001h
WPUD_WPUD3_MASK                          equ 0008h
WPUD_WPUD4_POSN                          equ 0004h
WPUD_WPUD4_POSITION                      equ 0004h
WPUD_WPUD4_SIZE                          equ 0001h
WPUD_WPUD4_LENGTH                        equ 0001h
WPUD_WPUD4_MASK                          equ 0010h
WPUD_WPUD5_POSN                          equ 0005h
WPUD_WPUD5_POSITION                      equ 0005h
WPUD_WPUD5_SIZE                          equ 0001h
WPUD_WPUD5_LENGTH                        equ 0001h
WPUD_WPUD5_MASK                          equ 0020h
WPUD_WPUD6_POSN                          equ 0006h
WPUD_WPUD6_POSITION                      equ 0006h
WPUD_WPUD6_SIZE                          equ 0001h
WPUD_WPUD6_LENGTH                        equ 0001h
WPUD_WPUD6_MASK                          equ 0040h
WPUD_WPUD7_POSN                          equ 0007h
WPUD_WPUD7_POSITION                      equ 0007h
WPUD_WPUD7_SIZE                          equ 0001h
WPUD_WPUD7_LENGTH                        equ 0001h
WPUD_WPUD7_MASK                          equ 0080h

// Register: ANSELD
#define ANSELD ANSELD
ANSELD                                   equ 0EA7h
// bitfield definitions
ANSELD_ANSELD0_POSN                      equ 0000h
ANSELD_ANSELD0_POSITION                  equ 0000h
ANSELD_ANSELD0_SIZE                      equ 0001h
ANSELD_ANSELD0_LENGTH                    equ 0001h
ANSELD_ANSELD0_MASK                      equ 0001h
ANSELD_ANSELD1_POSN                      equ 0001h
ANSELD_ANSELD1_POSITION                  equ 0001h
ANSELD_ANSELD1_SIZE                      equ 0001h
ANSELD_ANSELD1_LENGTH                    equ 0001h
ANSELD_ANSELD1_MASK                      equ 0002h
ANSELD_ANSELD2_POSN                      equ 0002h
ANSELD_ANSELD2_POSITION                  equ 0002h
ANSELD_ANSELD2_SIZE                      equ 0001h
ANSELD_ANSELD2_LENGTH                    equ 0001h
ANSELD_ANSELD2_MASK                      equ 0004h
ANSELD_ANSELD3_POSN                      equ 0003h
ANSELD_ANSELD3_POSITION                  equ 0003h
ANSELD_ANSELD3_SIZE                      equ 0001h
ANSELD_ANSELD3_LENGTH                    equ 0001h
ANSELD_ANSELD3_MASK                      equ 0008h
ANSELD_ANSELD4_POSN                      equ 0004h
ANSELD_ANSELD4_POSITION                  equ 0004h
ANSELD_ANSELD4_SIZE                      equ 0001h
ANSELD_ANSELD4_LENGTH                    equ 0001h
ANSELD_ANSELD4_MASK                      equ 0010h
ANSELD_ANSELD5_POSN                      equ 0005h
ANSELD_ANSELD5_POSITION                  equ 0005h
ANSELD_ANSELD5_SIZE                      equ 0001h
ANSELD_ANSELD5_LENGTH                    equ 0001h
ANSELD_ANSELD5_MASK                      equ 0020h
ANSELD_ANSELD6_POSN                      equ 0006h
ANSELD_ANSELD6_POSITION                  equ 0006h
ANSELD_ANSELD6_SIZE                      equ 0001h
ANSELD_ANSELD6_LENGTH                    equ 0001h
ANSELD_ANSELD6_MASK                      equ 0040h
ANSELD_ANSELD7_POSN                      equ 0007h
ANSELD_ANSELD7_POSITION                  equ 0007h
ANSELD_ANSELD7_SIZE                      equ 0001h
ANSELD_ANSELD7_LENGTH                    equ 0001h
ANSELD_ANSELD7_MASK                      equ 0080h

