GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.inc
// Register: TX4REG
#define TX4REG TX4REG
TX4REG                                   equ 0EE4h
// bitfield definitions
TX4REG_TX4REG_POSN                       equ 0000h
TX4REG_TX4REG_POSITION                   equ 0000h
TX4REG_TX4REG_SIZE                       equ 0008h
TX4REG_TX4REG_LENGTH                     equ 0008h
TX4REG_TX4REG_MASK                       equ 00FFh

// Register: SP4BRG
#define SP4BRG SP4BRG
SP4BRG                                   equ 0EE5h

// Register: SP4BRGL
#define SP4BRGL SP4BRGL
SP4BRGL                                  equ 0EE5h
// bitfield definitions
SP4BRGL_SP4BRGL_POSN                     equ 0000h
SP4BRGL_SP4BRGL_POSITION                 equ 0000h
SP4BRGL_SP4BRGL_SIZE                     equ 0008h
SP4BRGL_SP4BRGL_LENGTH                   equ 0008h
SP4BRGL_SP4BRGL_MASK                     equ 00FFh

// Register: SP4BRGH
#define SP4BRGH SP4BRGH
SP4BRGH                                  equ 0EE6h
// bitfield definitions
SP4BRGH_SP4BRGH_POSN                     equ 0000h
SP4BRGH_SP4BRGH_POSITION                 equ 0000h
SP4BRGH_SP4BRGH_SIZE                     equ 0008h
SP4BRGH_SP4BRGH_LENGTH                   equ 0008h
SP4BRGH_SP4BRGH_MASK                     equ 00FFh

// Register: RC4STA
#define RC4STA RC4STA
RC4STA                                   equ 0EE7h
// bitfield definitions
RC4STA_RX9D_POSN                         equ 0000h
RC4STA_RX9D_POSITION                     equ 0000h
RC4STA_RX9D_SIZE                         equ 0001h
RC4STA_RX9D_LENGTH                       equ 0001h
RC4STA_RX9D_MASK                         equ 0001h
RC4STA_OERR_POSN                         equ 0001h
RC4STA_OERR_POSITION                     equ 0001h
RC4STA_OERR_SIZE                         equ 0001h
RC4STA_OERR_LENGTH                       equ 0001h
RC4STA_OERR_MASK                         equ 0002h
RC4STA_FERR_POSN                         equ 0002h
RC4STA_FERR_POSITION                     equ 0002h
RC4STA_FERR_SIZE                         equ 0001h
RC4STA_FERR_LENGTH                       equ 0001h
RC4STA_FERR_MASK                         equ 0004h
RC4STA_ADDEN_POSN                        equ 0003h
RC4STA_ADDEN_POSITION                    equ 0003h
RC4STA_ADDEN_SIZE                        equ 0001h
RC4STA_ADDEN_LENGTH                      equ 0001h
RC4STA_ADDEN_MASK                        equ 0008h
RC4STA_CREN_POSN                         equ 0004h
RC4STA_CREN_POSITION                     equ 0004h
RC4STA_CREN_SIZE                         equ 0001h
RC4STA_CREN_LENGTH                       equ 0001h
RC4STA_CREN_MASK                         equ 0010h
RC4STA_SREN_POSN                         equ 0005h
RC4STA_SREN_POSITION                     equ 0005h
RC4STA_SREN_SIZE                         equ 0001h
RC4STA_SREN_LENGTH                       equ 0001h
RC4STA_SREN_MASK                         equ 0020h
RC4STA_RX9_POSN                          equ 0006h
RC4STA_RX9_POSITION                      equ 0006h
RC4STA_RX9_SIZE                          equ 0001h
RC4STA_RX9_LENGTH                        equ 0001h
RC4STA_RX9_MASK                          equ 0040h
RC4STA_SPEN_POSN                         equ 0007h
RC4STA_SPEN_POSITION                     equ 0007h
RC4STA_SPEN_SIZE                         equ 0001h
RC4STA_SPEN_LENGTH                       equ 0001h
RC4STA_SPEN_MASK                         equ 0080h

// Register: TX4STA
#define TX4STA TX4STA
TX4STA                                   equ 0EE8h
// bitfield definitions
TX4STA_TX9D_POSN                         equ 0000h
TX4STA_TX9D_POSITION                     equ 0000h
TX4STA_TX9D_SIZE                         equ 0001h
TX4STA_TX9D_LENGTH                       equ 0001h
TX4STA_TX9D_MASK                         equ 0001h
TX4STA_TRMT_POSN                         equ 0001h
TX4STA_TRMT_POSITION                     equ 0001h
TX4STA_TRMT_SIZE                         equ 0001h
TX4STA_TRMT_LENGTH                       equ 0001h
TX4STA_TRMT_MASK                         equ 0002h
TX4STA_BRGH_POSN                         equ 0002h
TX4STA_BRGH_POSITION                     equ 0002h
TX4STA_BRGH_SIZE                         equ 0001h
TX4STA_BRGH_LENGTH                       equ 0001h
TX4STA_BRGH_MASK                         equ 0004h
TX4STA_SENDB_POSN                        equ 0003h
TX4STA_SENDB_POSITION                    equ 0003h
TX4STA_SENDB_SIZE                        equ 0001h
TX4STA_SENDB_LENGTH                      equ 0001h
TX4STA_SENDB_MASK                        equ 0008h
TX4STA_SYNC_POSN                         equ 0004h
TX4STA_SYNC_POSITION                     equ 0004h
TX4STA_SYNC_SIZE                         equ 0001h
TX4STA_SYNC_LENGTH                       equ 0001h
TX4STA_SYNC_MASK                         equ 0010h
TX4STA_TXEN_POSN                         equ 0005h
TX4STA_TXEN_POSITION                     equ 0005h
TX4STA_TXEN_SIZE                         equ 0001h
TX4STA_TXEN_LENGTH                       equ 0001h
TX4STA_TXEN_MASK                         equ 0020h
TX4STA_TX9_POSN                          equ 0006h
TX4STA_TX9_POSITION                      equ 0006h
TX4STA_TX9_SIZE                          equ 0001h
TX4STA_TX9_LENGTH                        equ 0001h
TX4STA_TX9_MASK                          equ 0040h
TX4STA_CSRC_POSN                         equ 0007h
TX4STA_CSRC_POSITION                     equ 0007h
TX4STA_CSRC_SIZE                         equ 0001h
TX4STA_CSRC_LENGTH                       equ 0001h
TX4STA_CSRC_MASK                         equ 0080h

// Register: BAUD4CON
#define BAUD4CON BAUD4CON
BAUD4CON                                 equ 0EE9h
// bitfield definitions
BAUD4CON_ABDEN_POSN                      equ 0000h
BAUD4CON_ABDEN_POSITION                  equ 0000h
BAUD4CON_ABDEN_SIZE                      equ 0001h
BAUD4CON_ABDEN_LENGTH                    equ 0001h
BAUD4CON_ABDEN_MASK                      equ 0001h
BAUD4CON_WUE_POSN                        equ 0001h
BAUD4CON_WUE_POSITION                    equ 0001h
BAUD4CON_WUE_SIZE                        equ 0001h
BAUD4CON_WUE_LENGTH                      equ 0001h
BAUD4CON_WUE_MASK                        equ 0002h
BAUD4CON_BRG16_POSN                      equ 0003h
BAUD4CON_BRG16_POSITION                  equ 0003h
BAUD4CON_BRG16_SIZE                      equ 0001h
BAUD4CON_BRG16_LENGTH                    equ 0001h
BAUD4CON_BRG16_MASK                      equ 0008h
BAUD4CON_SCKP_POSN                       equ 0004h
BAUD4CON_SCKP_POSITION                   equ 0004h
BAUD4CON_SCKP_SIZE                       equ 0001h
BAUD4CON_SCKP_LENGTH                     equ 0001h
BAUD4CON_SCKP_MASK                       equ 0010h
BAUD4CON_RCIDL_POSN                      equ 0006h
BAUD4CON_RCIDL_POSITION                  equ 0006h
BAUD4CON_RCIDL_SIZE                      equ 0001h
BAUD4CON_RCIDL_LENGTH                    equ 0001h
BAUD4CON_RCIDL_MASK                      equ 0040h
BAUD4CON_ABDOVF_POSN                     equ 0007h
BAUD4CON_ABDOVF_POSITION                 equ 0007h
BAUD4CON_ABDOVF_SIZE                     equ 0001h
BAUD4CON_ABDOVF_LENGTH                   equ 0001h
BAUD4CON_ABDOVF_MASK                     equ 0080h

// Register: RC3REG
#define RC3REG RC3REG
RC3REG                                   equ 0EEAh
// bitfield definitions
RC3REG_RC3REG_POSN                       equ 0000h
RC3REG_RC3REG_POSITION                   equ 0000h
RC3REG_RC3REG_SIZE                       equ 0008h
RC3REG_RC3REG_LENGTH                     equ 0008h
RC3REG_RC3REG_MASK                       equ 00FFh

// Register: TX3REG
#define TX3REG TX3REG
TX3REG                                   equ 0EEBh
// bitfield definitions
TX3REG_TX3REG_POSN                       equ 0000h
TX3REG_TX3REG_POSITION                   equ 0000h
TX3REG_TX3REG_SIZE                       equ 0008h
TX3REG_TX3REG_LENGTH                     equ 0008h
TX3REG_TX3REG_MASK                       equ 00FFh

// Register: SP3BRG
#define SP3BRG SP3BRG
SP3BRG                                   equ 0EECh

