GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.inc
// Register: SCANTRIG
#define SCANTRIG SCANTRIG
SCANTRIG                                 equ 0F50h
// bitfield definitions
SCANTRIG_TSEL_POSN                       equ 0000h
SCANTRIG_TSEL_POSITION                   equ 0000h
SCANTRIG_TSEL_SIZE                       equ 0004h
SCANTRIG_TSEL_LENGTH                     equ 0004h
SCANTRIG_TSEL_MASK                       equ 000Fh
SCANTRIG_TSEL0_POSN                      equ 0000h
SCANTRIG_TSEL0_POSITION                  equ 0000h
SCANTRIG_TSEL0_SIZE                      equ 0001h
SCANTRIG_TSEL0_LENGTH                    equ 0001h
SCANTRIG_TSEL0_MASK                      equ 0001h
SCANTRIG_TSEL1_POSN                      equ 0001h
SCANTRIG_TSEL1_POSITION                  equ 0001h
SCANTRIG_TSEL1_SIZE                      equ 0001h
SCANTRIG_TSEL1_LENGTH                    equ 0001h
SCANTRIG_TSEL1_MASK                      equ 0002h
SCANTRIG_TSEL2_POSN                      equ 0002h
SCANTRIG_TSEL2_POSITION                  equ 0002h
SCANTRIG_TSEL2_SIZE                      equ 0001h
SCANTRIG_TSEL2_LENGTH                    equ 0001h
SCANTRIG_TSEL2_MASK                      equ 0004h
SCANTRIG_TSEL3_POSN                      equ 0003h
SCANTRIG_TSEL3_POSITION                  equ 0003h
SCANTRIG_TSEL3_SIZE                      equ 0001h
SCANTRIG_TSEL3_LENGTH                    equ 0001h
SCANTRIG_TSEL3_MASK                      equ 0008h
SCANTRIG_SCANTSEL_POSN                   equ 0000h
SCANTRIG_SCANTSEL_POSITION               equ 0000h
SCANTRIG_SCANTSEL_SIZE                   equ 0004h
SCANTRIG_SCANTSEL_LENGTH                 equ 0004h
SCANTRIG_SCANTSEL_MASK                   equ 000Fh
SCANTRIG_SCANTSEL0_POSN                  equ 0000h
SCANTRIG_SCANTSEL0_POSITION              equ 0000h
SCANTRIG_SCANTSEL0_SIZE                  equ 0001h
SCANTRIG_SCANTSEL0_LENGTH                equ 0001h
SCANTRIG_SCANTSEL0_MASK                  equ 0001h
SCANTRIG_SCANTSEL1_POSN                  equ 0001h
SCANTRIG_SCANTSEL1_POSITION              equ 0001h
SCANTRIG_SCANTSEL1_SIZE                  equ 0001h
SCANTRIG_SCANTSEL1_LENGTH                equ 0001h
SCANTRIG_SCANTSEL1_MASK                  equ 0002h
SCANTRIG_SCANTSEL2_POSN                  equ 0002h
SCANTRIG_SCANTSEL2_POSITION              equ 0002h
SCANTRIG_SCANTSEL2_SIZE                  equ 0001h
SCANTRIG_SCANTSEL2_LENGTH                equ 0001h
SCANTRIG_SCANTSEL2_MASK                  equ 0004h
SCANTRIG_SCANTSEL3_POSN                  equ 0003h
SCANTRIG_SCANTSEL3_POSITION              equ 0003h
SCANTRIG_SCANTSEL3_SIZE                  equ 0001h
SCANTRIG_SCANTSEL3_LENGTH                equ 0001h
SCANTRIG_SCANTSEL3_MASK                  equ 0008h

// Register: MDCON0
#define MDCON0 MDCON0
MDCON0                                   equ 0F51h
// bitfield definitions
MDCON0_BIT_POSN                          equ 0000h
MDCON0_BIT_POSITION                      equ 0000h
MDCON0_BIT_SIZE                          equ 0001h
MDCON0_BIT_LENGTH                        equ 0001h
MDCON0_BIT_MASK                          equ 0001h
MDCON0_OPOL_POSN                         equ 0004h
MDCON0_OPOL_POSITION                     equ 0004h
MDCON0_OPOL_SIZE                         equ 0001h
MDCON0_OPOL_LENGTH                       equ 0001h
MDCON0_OPOL_MASK                         equ 0010h
MDCON0_OUT_POSN                          equ 0005h
MDCON0_OUT_POSITION                      equ 0005h
MDCON0_OUT_SIZE                          equ 0001h
MDCON0_OUT_LENGTH                        equ 0001h
MDCON0_OUT_MASK                          equ 0020h
MDCON0_EN_POSN                           equ 0007h
MDCON0_EN_POSITION                       equ 0007h
MDCON0_EN_SIZE                           equ 0001h
MDCON0_EN_LENGTH                         equ 0001h
MDCON0_EN_MASK                           equ 0080h
MDCON0_MDBIT_POSN                        equ 0000h
MDCON0_MDBIT_POSITION                    equ 0000h
MDCON0_MDBIT_SIZE                        equ 0001h
MDCON0_MDBIT_LENGTH                      equ 0001h
MDCON0_MDBIT_MASK                        equ 0001h
MDCON0_MDOPOL_POSN                       equ 0004h
MDCON0_MDOPOL_POSITION                   equ 0004h
MDCON0_MDOPOL_SIZE                       equ 0001h
MDCON0_MDOPOL_LENGTH                     equ 0001h
MDCON0_MDOPOL_MASK                       equ 0010h
MDCON0_MDOUT_POSN                        equ 0005h
MDCON0_MDOUT_POSITION                    equ 0005h
MDCON0_MDOUT_SIZE                        equ 0001h
MDCON0_MDOUT_LENGTH                      equ 0001h
MDCON0_MDOUT_MASK                        equ 0020h
MDCON0_MDEN_POSN                         equ 0007h
MDCON0_MDEN_POSITION                     equ 0007h
MDCON0_MDEN_SIZE                         equ 0001h
MDCON0_MDEN_LENGTH                       equ 0001h
MDCON0_MDEN_MASK                         equ 0080h

// Register: MDCON1
#define MDCON1 MDCON1
MDCON1                                   equ 0F52h
// bitfield definitions
MDCON1_CLSYNC_POSN                       equ 0000h
MDCON1_CLSYNC_POSITION                   equ 0000h
MDCON1_CLSYNC_SIZE                       equ 0001h
MDCON1_CLSYNC_LENGTH                     equ 0001h
MDCON1_CLSYNC_MASK                       equ 0001h
MDCON1_CLPOL_POSN                        equ 0001h
MDCON1_CLPOL_POSITION                    equ 0001h
MDCON1_CLPOL_SIZE                        equ 0001h
MDCON1_CLPOL_LENGTH                      equ 0001h
MDCON1_CLPOL_MASK                        equ 0002h
MDCON1_CHSYNC_POSN                       equ 0004h
MDCON1_CHSYNC_POSITION                   equ 0004h
MDCON1_CHSYNC_SIZE                       equ 0001h
MDCON1_CHSYNC_LENGTH                     equ 0001h
MDCON1_CHSYNC_MASK                       equ 0010h
MDCON1_CHPOL_POSN                        equ 0005h
MDCON1_CHPOL_POSITION                    equ 0005h
MDCON1_CHPOL_SIZE                        equ 0001h
MDCON1_CHPOL_LENGTH                      equ 0001h
MDCON1_CHPOL_MASK                        equ 0020h
MDCON1_MDCLSYNC_POSN                     equ 0000h
MDCON1_MDCLSYNC_POSITION                 equ 0000h
MDCON1_MDCLSYNC_SIZE                     equ 0001h
MDCON1_MDCLSYNC_LENGTH                   equ 0001h
MDCON1_MDCLSYNC_MASK                     equ 0001h
MDCON1_MDCLPOL_POSN                      equ 0001h
MDCON1_MDCLPOL_POSITION                  equ 0001h
MDCON1_MDCLPOL_SIZE                      equ 0001h
MDCON1_MDCLPOL_LENGTH                    equ 0001h
MDCON1_MDCLPOL_MASK                      equ 0002h
MDCON1_MDCHSYNC_POSN                     equ 0004h
MDCON1_MDCHSYNC_POSITION                 equ 0004h
MDCON1_MDCHSYNC_SIZE                     equ 0001h
MDCON1_MDCHSYNC_LENGTH                   equ 0001h
MDCON1_MDCHSYNC_MASK                     equ 0010h
MDCON1_MDCHPOL_POSN                      equ 0005h
MDCON1_MDCHPOL_POSITION                  equ 0005h
MDCON1_MDCHPOL_SIZE                      equ 0001h
MDCON1_MDCHPOL_LENGTH                    equ 0001h
MDCON1_MDCHPOL_MASK                      equ 0020h

