GopalSaraf/Practicals/PSDL/include/proc/pic18lf67k40.inc
#define TMR7L1                           BANKMASK(TMR7L), 1, b
#define TMR7L2                           BANKMASK(TMR7L), 2, b
#define TMR7L3                           BANKMASK(TMR7L), 3, b
#define TMR7L4                           BANKMASK(TMR7L), 4, b
#define TMR7L5                           BANKMASK(TMR7L), 5, b
#define TMR7L6                           BANKMASK(TMR7L), 6, b
#define TMR7L7                           BANKMASK(TMR7L), 7, b
#define TMR7MD                           BANKMASK(PMD1), 7, b
#define TMR7ON                           BANKMASK(T7CON), 0, b
#define TMR8IE                           BANKMASK(PIE5), 7, b
#define TMR8IF                           BANKMASK(PIR5), 7, b
#define TMR8IP                           BANKMASK(IPR5), 7, b
#define TMR8MD                           BANKMASK(PMD2), 0, b
#define TMR8ON                           BANKMASK(T8CON), 7, b
#define TO                               BANKMASK(STATUS), 6, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRISE3                           BANKMASK(TRISE), 3, a
#define TRISE4                           BANKMASK(TRISE), 4, a
#define TRISE5                           BANKMASK(TRISE), 5, a
#define TRISE6                           BANKMASK(TRISE), 6, a
#define TRISE7                           BANKMASK(TRISE), 7, a
#define TRISF0                           BANKMASK(TRISF), 0, a
#define TRISF1                           BANKMASK(TRISF), 1, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TRISG0                           BANKMASK(TRISG), 0, a
#define TRISG1                           BANKMASK(TRISG), 1, a
#define TRISG2                           BANKMASK(TRISG), 2, a
#define TRISG3                           BANKMASK(TRISG), 3, a
#define TRISG4                           BANKMASK(TRISG), 4, a
#define TRISG6                           BANKMASK(TRISG), 6, a
#define TRISG7                           BANKMASK(TRISG), 7, a
#define TRISH0                           BANKMASK(TRISH), 0, a
#define TRISH1                           BANKMASK(TRISH), 1, a
#define TRISH2                           BANKMASK(TRISH), 2, a
#define TRISH3                           BANKMASK(TRISH), 3, a
#define TRMT1                            BANKMASK(TX1STA), 1, a
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TX1IE                            BANKMASK(PIE3), 4, b
#define TX1IF                            BANKMASK(PIR3), 4, b
#define TX1IP                            BANKMASK(IPR3), 4, b
#define TX1PPS0                          BANKMASK(CK1PPS), 0, b
#define TX1PPS1                          BANKMASK(CK1PPS), 1, b
#define TX1PPS2                          BANKMASK(CK1PPS), 2, b
#define TX1PPS3                          BANKMASK(CK1PPS), 3, b
#define TX1PPS4                          BANKMASK(CK1PPS), 4, b
#define TX2IE                            BANKMASK(PIE3), 6, b
#define TX2IF                            BANKMASK(PIR3), 6, b
#define TX2IP                            BANKMASK(IPR3), 6, b
#define TX2PPS0                          BANKMASK(CK2PPS), 0, b
#define TX2PPS1                          BANKMASK(CK2PPS), 1, b
#define TX2PPS2                          BANKMASK(CK2PPS), 2, b
#define TX2PPS3                          BANKMASK(CK2PPS), 3, b
#define TX2PPS4                          BANKMASK(CK2PPS), 4, b
#define TX2PPS5                          BANKMASK(CK2PPS), 5, b
#define TX3IE                            BANKMASK(PIE4), 0, b
#define TX3IF                            BANKMASK(PIR4), 0, b
#define TX3IP                            BANKMASK(IPR4), 0, b
#define TX3PPS0                          BANKMASK(CK3PPS), 0, b
#define TX3PPS1                          BANKMASK(CK3PPS), 1, b
#define TX3PPS2                          BANKMASK(CK3PPS), 2, b
#define TX3PPS3                          BANKMASK(CK3PPS), 3, b
#define TX3PPS4                          BANKMASK(CK3PPS), 4, b
#define TX3PPS5                          BANKMASK(CK3PPS), 5, b
#define TX4IE                            BANKMASK(PIE4), 2, b
#define TX4IF                            BANKMASK(PIR4), 2, b
#define TX4IP                            BANKMASK(IPR4), 2, b
#define TX4PPS0                          BANKMASK(CK4PPS), 0, b
#define TX4PPS1                          BANKMASK(CK4PPS), 1, b
#define TX4PPS2                          BANKMASK(CK4PPS), 2, b
#define TX4PPS3                          BANKMASK(CK4PPS), 3, b
#define TX4PPS4                          BANKMASK(CK4PPS), 4, b
#define TX5IE                            BANKMASK(PIE4), 4, b
#define TX5IF                            BANKMASK(PIR4), 4, b
#define TX5IP                            BANKMASK(IPR4), 4, b
#define TX5PPS0                          BANKMASK(CK5PPS), 0, b
#define TX5PPS1                          BANKMASK(CK5PPS), 1, b
#define TX5PPS2                          BANKMASK(CK5PPS), 2, b
#define TX5PPS3                          BANKMASK(CK5PPS), 3, b
#define TX5PPS4                          BANKMASK(CK5PPS), 4, b
#define TX5PPS5                          BANKMASK(CK5PPS), 5, b
#define TX8_9                            BANKMASK(TX1STA), 6, a
#define TX8_92                           BANKMASK(TX2STA), 6, b
#define TX91                             BANKMASK(TX1STA), 6, a
#define TX9D1                            BANKMASK(TX1STA), 0, a
#define TXB0IE                           BANKMASK(PIE3), 2, b
#define TXB1IE                           BANKMASK(PIE3), 3, b
#define TXB2IE                           BANKMASK(PIE3), 4, b
#define TXBNIE                           BANKMASK(PIE3), 4, b
#define TXBNIF                           BANKMASK(PIR3), 4, b
#define TXBNIP                           BANKMASK(IPR3), 4, b
#define TXCKP                            BANKMASK(BAUD1CON), 4, a
#define TXCKP1                           BANKMASK(BAUD1CON), 4, a
#define TXCKP2                           BANKMASK(BAUD2CON), 4, b
#define TXD8                             BANKMASK(TX1STA), 0, a
#define TXD82                            BANKMASK(TX2STA), 0, b
#define TXEN1                            BANKMASK(TX1STA), 5, a
#define UA1                              BANKMASK(SSP1STAT), 1, a
#define UA2                              BANKMASK(SSP2STAT), 1, b
#define UART1MD                          BANKMASK(PMD5), 2, b
#define UART2MD                          BANKMASK(PMD5), 3, b
#define UART3MD                          BANKMASK(PMD5), 4, b
#define UART4MD                          BANKMASK(PMD5), 5, b
#define UART5MD                          BANKMASK(PMD5), 6, b
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define W4E                              BANKMASK(BAUD1CON), 1, a
#define WCOL1                            BANKMASK(SSP1CON1), 7, a
#define WCOL2                            BANKMASK(SSP2CON1), 7, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0, b
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1, b
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2, b
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3, b
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4, b
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5, b
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6, b
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2, b
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3, b
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4, b
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5, b
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6, b
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7, b
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0, b
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUD0                            BANKMASK(WPUD), 0, b
#define WPUD1                            BANKMASK(WPUD), 1, b
#define WPUD2                            BANKMASK(WPUD), 2, b
#define WPUD3                            BANKMASK(WPUD), 3, b
#define WPUD4                            BANKMASK(WPUD), 4, b
#define WPUD5                            BANKMASK(WPUD), 5, b
#define WPUD6                            BANKMASK(WPUD), 6, b
#define WPUD7                            BANKMASK(WPUD), 7, b
#define WPUE0                            BANKMASK(WPUE), 0, b
#define WPUE1                            BANKMASK(WPUE), 1, b
#define WPUE2                            BANKMASK(WPUE), 2, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WPUE4                            BANKMASK(WPUE), 4, b
#define WPUE5                            BANKMASK(WPUE), 5, b
#define WPUE6                            BANKMASK(WPUE), 6, b
#define WPUE7                            BANKMASK(WPUE), 7, b
#define WPUF0                            BANKMASK(WPUF), 0, b
#define WPUF1                            BANKMASK(WPUF), 1, b
#define WPUF2                            BANKMASK(WPUF), 2, b
#define WPUF3                            BANKMASK(WPUF), 3, b
#define WPUF4                            BANKMASK(WPUF), 4, b
#define WPUF5                            BANKMASK(WPUF), 5, b
#define WPUF6                            BANKMASK(WPUF), 6, b
#define WPUF7                            BANKMASK(WPUF), 7, b
#define WPUG0                            BANKMASK(WPUG), 0, b
#define WPUG1                            BANKMASK(WPUG), 1, b
#define WPUG2                            BANKMASK(WPUG), 2, b
#define WPUG3                            BANKMASK(WPUG), 3, b
#define WPUG4                            BANKMASK(WPUG), 4, b
#define WPUG5                            BANKMASK(WPUG), 5, b
#define WPUG6                            BANKMASK(WPUG), 6, b
#define WPUG7                            BANKMASK(WPUG), 7, b
#define WPUH0                            BANKMASK(WPUH), 0, b
#define WPUH1                            BANKMASK(WPUH), 1, b
#define WPUH2                            BANKMASK(WPUH), 2, b
#define WPUH3                            BANKMASK(WPUH), 3, b
#define WR                               BANKMASK(NVMCON1), 1, a
#define WRE                              BANKMASK(PORTE), 1, a
#define WREN                             BANKMASK(NVMCON1), 2, a
#define WRERR                            BANKMASK(NVMCON1), 3, a
#define WUE1                             BANKMASK(BAUD1CON), 1, a
#define WUE2                             BANKMASK(BAUD2CON), 1, b
#define X1                               BANKMASK(CRCXORL), 1, b
#define X10                              BANKMASK(CRCXORH), 2, b
#define X11                              BANKMASK(CRCXORH), 3, b
#define X12                              BANKMASK(CRCXORH), 4, b
#define X13                              BANKMASK(CRCXORH), 5, b
#define X14                              BANKMASK(CRCXORH), 6, b
#define X15                              BANKMASK(CRCXORH), 7, b
#define X2                               BANKMASK(CRCXORL), 2, b
#define X3                               BANKMASK(CRCXORL), 3, b
#define X4                               BANKMASK(CRCXORL), 4, b
#define X5                               BANKMASK(CRCXORL), 5, b
#define X6                               BANKMASK(CRCXORL), 6, b
#define X7                               BANKMASK(CRCXORL), 7, b
#define X8                               BANKMASK(CRCXORH), 0, b
#define X9                               BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE2), 6, b
#define ZCDIF                            BANKMASK(PIR2), 6, b
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR2), 6, b
#define ZCDMD                            BANKMASK(PMD3), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define ZERO                             BANKMASK(STATUS), 2, a
#define nADDRESS1                        BANKMASK(SSP1STAT), 5, a
#define nADDRESS2                        BANKMASK(SSP2STAT), 5, b
#define nBOR                             BANKMASK(PCON0), 0, a
#define nPD                              BANKMASK(STATUS), 5, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nT1SYNC                          BANKMASK(T1CON), 2, a
#define nT3SYNC                          BANKMASK(T3CON), 2, a
#define nT5SYNC                          BANKMASK(T5CON), 2, a
#define nT7SYNC                          BANKMASK(T7CON), 2, b
#define nTO                              BANKMASK(STATUS), 6, a
#define nWDTWV                           BANKMASK(PCON0), 5, a
#define nWRITE1                          BANKMASK(SSP1STAT), 2, a
#define nWRITE2                          BANKMASK(SSP2STAT), 2, b

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec,lowdata
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec,lowdata
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18LF67K40_INC_
